

"Checking" = "检查中...";

"No updates found" = "恭喜！您当前的版本已经是最新";

"Update checking error" = "检查出错，请稍后重试。";

"Feedback" = "用户反馈";

"Check for update" = "检查新版本";

"Version" = "版本";

"New Version Found" = "发现新版本: ";

"Skip" = "跳过";

"Ignore" = "忽略";

"Update now" = "立即更新";

"About" = "关于";

"Return" = "返回";

"Current Location" = "当前位置";

"Target Location" = "穿越位置";

"Exploring On..." = "您正在穿越中...";

"Exploring Off..." = "已退出穿越...";

"Longitude" = "经度";

"Latitude" = "纬度";

"You must choose a location before traveling" = "请选择穿越位置(长按地图)";

"Notice" = "提示";

"Ok" = "好";

"Done" = "完成";

"Location service unvailable, check your settings please." = "无法定位。请去\"设置\"中为\"GPS穿越器\"开启定位服务";

"Positioning..." = "定位中...";

"Location service unvailable, traveling fails" = "当前位置无法确定，启动穿越失败";

"Favorites" = "收藏";

"No favorites yet" = "暂无收藏地址";

"No geo info yet" = "暂无地址描述信息";

"You can collect locations not more than %d" = "收藏失败。您最多收藏%d个地址";

"Record is in favorites already" = "不能重复收藏";

"Favorites" = "收藏";
"The Hot" = "热门";
"POIs" = "穿越点";
"Setting" = "设置";
"User Feedback" = "用户反馈";
"User Instructions" = "使用说明";
"My Points" = "我的能量点";
"Acuire Points" = "增加补给";
"Points" = "能量点";
"Points Instruction" = "请注意查看每个任务的具体流程并严格遵守(如试用3分钟)，避免完成任务后无法检测到新增的能量点";
"I know" = "知道了";

"This travel needs %d points, please acuire more points" = "穿越到此地需要消耗%d个能量点，请进行补给。";
"Points low, please acquire more" = "你的能量过低，请进行补给";

"This travel consumes %d points" = "-%d";
"Acquire now" = "立即补给";
"Later" = "不了";
"meter(s)" = "m";
"km(s)" = "km";
"Unknown" = "未知";
"Location info loading..." = "地理信息获取中...";
